src/src/Catalogs/CompanyResources.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>CompanyResources</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Capacity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResourceValue</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Teams</v8:Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/InformationRegisters/CompanyResourceTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>CompanyResourceTypes</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>CompanyResourceType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompanyResourceTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CompanyResource</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompanyResources</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/Catalogs/CompanyResources/Forms/ChoiceForm/Ext/Form/Module.bsl
&AtServer
Procedure SetFilterByResourceKind(FilterResourceKind)
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	CompanyResourceTypes.CompanyResource AS CompanyResource
	|FROM
	|	InformationRegister.CompanyResourceTypes AS CompanyResourceTypes
	|WHERE
	|	CompanyResourceTypes.CompanyResourceType = &CompanyResourceType";
	
	Query.SetParameter("CompanyResourceType", FilterResourceKind);
	Selection = Query.Execute().Select();
	ListResourcesKinds = New ValueList;
	While Selection.Next() Do
		ListResourcesKinds.Add(Selection.CompanyResource);
	EndDo;
	
	DriveClientServer.SetListFilterItem(List, "Ref", ListResourcesKinds, True, DataCompositionComparisonType.InList);
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("FilterResourceKind") Then
		
		FilterResourceKind = Parameters.FilterResourceKind;
		If ValueIsFilled(FilterResourceKind) Then
			SetFilterByResourceKind(FilterResourceKind)
		EndIf;
		
	EndIf;
	
EndProcedure
